glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM302x_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AnalogDevices</vendor>
  <name>ADuCM302x_DFP</name>
  <description>Analog Devices ADuCM302x Device Support. (Subject to the Software License Agreement referred to in the Release Notes.)</description>
  <url>http://download.analog.com/tools/EZBoards/CM302x/Releases/</url>
  <supportContact>http://www.analog.com/en/support/technical-support.html</supportContact>
  <license>License/2017-05-17-CM302xEZDFP Click Thru SLA.txt</license>

  <releases>
    <release version="3.2.0"  date="2018-08-03">
      API extension for RTC driver.
      Bug fixes for RTC, SPI and UART drivers.
    </release>
    <release version="3.1.2"  date="2018-04-11">
      Unsupported crypto driver compilation error fixed
      GPIO driver API extended with adi_gpio_GroupInterruptPolarityEnable to determine if the interrupts are generated
      on the rising or falling edge of the corresponding GPIO pin.
      RTC driver modified to eliminate the risks of counter overflows.
      RTOS mapping extended with Micrium uC/OS-II.
      UART driver updated for PIO Rx transfers to support all the FIFO trigger levels.
    </release>
    <release version="3.1.0"  date="2018-01-22">
      Further version synchronization across IoT CMSIS Pack products
      Flash controller driver default settings modified to enable ECC.
      New APIs and fixes to drivers
      - FLash driver API extended to support wait states configuration
      - GPIO driver API extended to read group interrupt and output information, and
        to enable/disable increased drive strength capability
      - Fix issues in PWR driver
      - RTC driver API extended with functions to get and clear interrupt status
      - SPI driver API extended with functions to set clock phase and polarity
    </release>
    <release version="2.0.0" date="2017-05-31">
      API Changes to suit IoT applications
    </release>
    <release version="1.0.6" date="2017-09-05">
      Support release
    </release>
        <release version="1.0.5" date="2017-05-25">
      Enables ECC during flash programming
    </release>
    <release version="1.0.4" date="2017-03-13">
      Support release
    </release>
    <release version="1.0.3" date="2017-01-05">
      Release supporting CrossCore Embedded Studio
    </release>
    <release version="1.0.2" date="2016-10-19">
      Initial Release
    </release>
  </releases>

  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.3.0"/>
    </packages>
  </requirements>

  <boards>
    <board vendor="AnalogDevices" name="ADuCM3029 EZ-KIT" revision="Ver 1.0">
      <description>Analog Devices ADuCM3029 Evaluation Board</description>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM3029"/>
      <compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dfamily="ADuCM302x Series"/>
      <feature type="PWR"             n="5"              name="External 5.0VDC/3.6A power supply"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
    </board>
  </boards>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Analog Devices</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Analog Devices</keyword>
    <keyword>ADuCM302x</keyword>
    <keyword>ADuCM3027</keyword>
    <keyword>ADuCM3029</keyword>
  </keywords>

  <devices>
    <family Dfamily="ADuCM302x Series" Dvendor="Analog Devices:1">
      <description>
        The ADuCM302x is an ultra low-power integrated mixed-signal microcontroller system for processing, control and connectivity. The MCU system is based on an ARM Cortex(TM)-M3 processor, a collection of digital peripherals, embedded SRAM and flash memory, and an analog subsystem which provides clocking, reset and power management capability along with ADC.
      </description>

      <environment name="uv">
        <CMisc>--C99</CMisc>
        <AMisc>--cpreproc --cpreproc_opts=-U__STDC__,-D__ASSEMBLER__</AMisc>
      </environment>

      <environment name="cces">
        <properties>
          <property name="toolchain" value="arm.gcc.toolchain"/>
          <property name="gdb-qemu" value="false"/>
        </properties>

        <silicon-revisions command-line-default="1.0">
          <silicon revision="none"/>
          <silicon revision="1.0"/>
          <silicon revision="1.1"/>
          <silicon revision="1.2"/>
          <silicon revision="any"/>
        </silicon-revisions>
      </environment>

      <!-- ******************************  ADuCM3027  ****************************** -->
      <device Dname="ADuCM3027">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="26000000"/>
        <environment name="iar">
          <file category="i79file" name="ARM/config/devices/AnalogDevices/ADuCM3027.i79" />
        </environment>
        <debug      svd="SVD/ADuCM302x.svd"/>
        <algorithm  name="Flash/ADuCM302x.FLM"      start="0x00000000"  size="0x20000"  default="1"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"  startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x04000"  init   ="1"   default="1"/>
        <memory     id="IRAM2"                      start="0x20040000"  size="0x04000"  init   ="1"   default="1"/>
        <compile header="Include/ADuCM3027.h"  define="__ADUCM3027__"/>
      </device>

      <!-- ******************************  ADuCM3029  ****************************** -->
      <device Dname="ADuCM3029">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="26000000"/>
        <environment name="iar">
          <file category="i79file" name="ARM/config/devices/AnalogDevices/ADuCM3029.i79" />
        </environment>
        <debug      svd="SVD/ADuCM302x.svd"/>
        <algorithm  name="Flash/ADuCM302x.FLM"      start="0x00000000"  size="0x40000"  default="1"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"  startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x04000"  init   ="1"   default="1"/>
        <memory     id="IRAM2"                      start="0x20040000"  size="0x04000"  init   ="1"   default="1"/>
        <compile header="Include/ADuCM3029.h"  define="__ADUCM3029__"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="IAR">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ADuCM302x">
      <description>ADuCM302x device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM3027"/>
      <accept Dname="ADuCM3029"/>
    </condition>
