glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM302x_DFP.pdsc
    <component Cclass="Device" Cgroup="Retarget_UART" Cversion="3.2.0" condition="ADuCM302x CompilerIO">
      <description>Compiler::IO support for ADuCM302x devices</description>
      <files>
        <file category="source" name="Source/retarget_uart.c" />
        <file category="header" name="Include/retarget_uart_config.h" version="3.2.0" attr="config" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Examples Support" Cversion="3.2.0" condition="ADuCM302x Examples Support">
      <description>Common utility functions for ADuCM302x examples</description>
      <files>
        <file category="source" name="Source/common.c"/>
        <file category="header" name="Include/common.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Global Configuration" Cversion="3.2.0" condition="ADuCM302x">
      <description>Global configuration files for ADuCM302x drivers</description>
      <files>
        <file category="header" name="Include/config/adi_cycle_counting_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Cycle Count" Cversion="3.2.0" condition="ADuCM302x Cycle Count">
      <description>Common utility functions for ADuCM302x examples</description>
      <files>
        <file category="source" name="Source/adi_cyclecount.c"/>
        <file category="header" name="Include/adi_cyclecount.h"/>
        <file category="header" name="Include/config/adi_cycle_counting_config.h" version="3.2.0" attr="config"/>
      </files>
    </component>

    <!-- Drivers -->
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="3.2.0" condition="ADuCM302x ADC">
      <description>ADC</description>
      <files>
        <file category="source" name="Source/drivers/adc/adi_adc.c"/>
        <file category="header" name="Include/drivers/adc/adi_adc.h"/>
        <file category="header" name="Include/config/adi_adc_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___a_d_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="BEEP" Cversion="3.2.0" condition="ADuCM302x BEEP">
      <description>BEEP</description>
      <files>
        <file category="source" name="Source/drivers/beep/adi_beep.c"/>
        <file category="header" name="Include/drivers/beep/adi_beep.h"/>
        <file category="header" name="Include/config/adi_beep_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___b_e_e_p___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>CRC</description>
      <files>
        <file category="source" name="Source/drivers/crc/adi_crc.c"/>
        <file category="header" name="Include/drivers/crc/adi_crc.h"/>
        <file category="header" name="Include/config/adi_crc_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___c_r_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Crypto" Cversion="3.2.0" condition="ADuCM302x Crypto">
      <description>Crypto</description>
      <files>
        <file category="source" name="Source/drivers/crypto/adi_crypto.c"/>
        <file category="header" name="Include/drivers/crypto/adi_crypto.h"/>
        <file category="header" name="Include/config/adi_crypto_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___crypto___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>DMA</description>
      <files>
        <file category="source" name="Source/drivers/dma/adi_dma.c"/>
        <file category="header" name="Include/drivers/dma/adi_dma.h"/>
        <file category="doc" name="Documents/html/group___d_m_a___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Flash" Cversion="3.2.0" condition="ADuCM302x Flash">
      <description>Flash Controller</description>
      <files>
        <file category="source" name="Source/drivers/flash/adi_flash.c"/>
        <file category="header" name="Include/drivers/flash/adi_flash.h"/>
        <file category="header" name="Include/config/adi_flash_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___flash___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="GPIO" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>GPIO</description>
      <files>
        <file category="source" name="Source/drivers/gpio/adi_gpio.c"/>
        <file category="header" name="Include/drivers/gpio/adi_gpio.h"/>
        <file category="doc" name="Documents/html/group___g_p_i_o___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="3.2.0" condition="ADuCM302x I2C">
      <description>I2C</description>
      <files>
        <file category="source" name="Source/drivers/i2c/adi_i2c.c"/>
        <file category="header" name="Include/drivers/i2c/adi_i2c.h"/>
        <file category="header" name="Include/config/adi_i2c_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___i2_c___driver.html"/>
      </files>
    </component>

